In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [7]:
cities = pd.read_csv('cities.csv', encoding='ISO-8859-1')
customers = pd.read_csv('customers.csv', encoding='ISO-8859-1')
item_master = pd.read_csv('item_master.csv', encoding='ISO-8859-1')
sales_rep = pd.read_csv('sales_rep.csv', encoding='ISO-8859-1')
sales = pd.read_csv('sales.csv', encoding='ISO-8859-1')

In [26]:
cities.duplicated().any()

False

In [27]:
customers.duplicated().any()

False

In [28]:
item_master.duplicated().any()

False

In [29]:
sales_rep.duplicated().any()

False

In [30]:
sales.duplicated().any()

False

In [32]:
cities.isnull().any()

City         False
City Code    False
Region       False
Latitude     False
Longitude    False
Desc          True
dtype: bool

In [33]:
customers.isnull().any()

Customer           False
Customer Number    False
City Code          False
dtype: bool

In [34]:
item_master.isnull().any()

Item Number          False
Product Group        False
Product Line         False
Product Sub Group    False
Product Type         False
dtype: bool

In [35]:
sales_rep.isnull().any()

Manager            False
Manager Number     False
Path               False
Sales Rep Name     False
Sales Rep Name1    False
Sales Rep Name2     True
Sales Rep Name3     True
Sales Rep ID       False
dtype: bool

In [36]:
sales.isnull().any()

%KEY                      False
Cost                      False
Customer Number           False
Date                      False
GrossSales                False
Invoice Date              False
Invoice Number            False
Item Desc                 False
Item Number               False
Margin                    False
Order Number              False
Promised Delivery Date    False
Sales                     False
Sales Qty                 False
Sales Rep Number          False
dtype: bool

In [43]:
cities.head()

,City,City Code,Region,Latitude,Longitude,Desc
0,New York,1,USA,40.730599,-73.986581,"""New York City, NY, US"""
1,Los Angeles,2,USA,34.053678,-118.242702,"""Los Angeles, Los Angeles County, CA, US"""
2,Chicago,3,USA,41.875555,-87.624421,"""Chicago, Cook County, IL, US"""
3,Houston,4,USA,29.981501,-95.538360,"""Houston, Harris County, TX, US"""
4,Philadelphia,5,USA,39.952335,-75.163789,"""Philadelphia, Philadelphia County, PA, US"""

In [38]:
customers.head()

            Customer  Customer Number  City Code
0  A Superior System         10000453          1
1                A&B         10000456         76
2                A&G         10000457          2
3       A&R Partners         10000458         43
4  A1 Datacom Supply         10000461         77

In [39]:
item_master.head()

,Item Number,Product Group,Product Line,Product Sub Group,Product Type
0,10001,Beverages,Drink,Juice,Pure Juice Beverages
1,10002,Beverages,Drink,Flavored Drinks,Drinks
2,10003,Beverages,Drink,Flavored Drinks,Drinks
3,10004,Beverages,Drink,Soda,Carbonated Beverages
4,10005,Beverages,Drink,Soda,Carbonated Beverages

In [40]:
sales_rep.head()

,Manager,Manager Number,Path,Sales Rep Name,Sales Rep Name1,Sales Rep Name2,Sales Rep Name3,Sales Rep ID
0,Amanda Honda,104,Amanda Honda-Amalia Craig,Amalia Craig,Amanda Honda,Amalia Craig,NaN,103
1,Amanda Honda,104,Amanda Honda-Cart Lynch,Cart Lynch,Amanda Honda,Cart Lynch,NaN,112
2,Amanda Honda,104,Amanda Honda-Molly McKenzie,Molly McKenzie,Amanda Honda,Molly McKenzie,NaN,159
3,Amanda Honda,104,Amanda Honda-Sheila Hein,Sheila Hein,Amanda Honda,Sheila Hein,NaN,176
4,Brenda Gibson,109,Brenda Gibson-Dennis Johnson,Dennis Johnson,Brenda Gibson,Dennis Johnson,NaN,121

In [41]:
sales.head()

,%KEY,Cost,Customer Number,Date,GrossSales,Invoice Date,Invoice Number,Item Desc,Item Number,Margin,Order Number,Promised Delivery Date,Sales,Sales Qty,Sales Rep Number
0,3428,-513.15,10012226,1/12/2012,-573.3835,1/12/2012,318960,Cutting Edge Sliced Ham,10696,-37.29,115785,1/12/2012,-550.44,-1.0,180
1,3429,-105.93,10012226,1/12/2012,-204.6638,1/12/2012,318960,Washington Cranberry Juice,10009,-90.54,115785,1/12/2012,-196.47,-2.0,180
2,3430,-88.07,10012226,1/12/2012,-165.8016,1/12/2012,318960,Moms Sliced Ham,10385,-71.10,115785,1/12/2012,-159.17,-3.0,180
3,3431,-43.12,10012226,1/12/2012,-118.3703,1/12/2012,318960,Tip Top Lox,10215,-70.52,115785,1/12/2012,-113.64,-1.0,180
4,3432,-37.98,10012226,1/12/2012,-102.3319,1/12/2012,318960,Just Right Beef Soup,10965,-60.26,115785,1/12/2012,-98.24,-1.0,180

In [44]:
cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City       100 non-null    object
 1   City Code  100 non-null    int64
 2   Region     100 non-null    object
 3   Latitude   100 non-null    float64
 4   Longitude  100 non-null    float64
 5   Desc       99 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 4.8+ KB

In [64]:
cities.loc[cities['Desc'].isnull()]

        City  City Code Region   Latitude   Longitude Desc
94  Yokohama         95  Japan  35.455592  139.572196  NaN

In [68]:
cities['Desc'] = cities['Desc'].fillna("Yokohama, Kanagawa, Japan")

In [69]:
cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City       100 non-null    object
 1   City Code  100 non-null    int64
 2   Region     100 non-null    object
 3   Latitude   100 non-null    float64
 4   Longitude  100 non-null    float64
 5   Desc       100 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 4.8+ KB

In [49]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 684 entries, 0 to 683
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer         684 non-null    object
 1   Customer Number  684 non-null    int64
 2   City Code        684 non-null    int64
dtypes: int64(2), object(1)
memory usage: 16.2+ KB

In [50]:
item_master.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 827 entries, 0 to 826
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Item Number        827 non-null    int64
 1   Product Group      827 non-null    object
 2   Product Line       827 non-null    object
 3   Product Sub Group  827 non-null    object
 4   Product Type       827 non-null    object
dtypes: int64(1), object(4)
memory usage: 32.4+ KB

In [51]:
sales_rep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Manager          64 non-null     object
 1   Manager Number   64 non-null     int64
 2   Path             64 non-null     object
 3   Sales Rep Name   64 non-null     object
 4   Sales Rep Name1  64 non-null     object
 5   Sales Rep Name2  59 non-null     object
 6   Sales Rep Name3  39 non-null     object
 7   Sales Rep ID     64 non-null     int64
dtypes: int64(2), object(6)
memory usage: 4.1+ KB

In [74]:
sales_rep = sales_rep.fillna('Unknown')
sales_rep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Manager          64 non-null     object
 1   Manager Number   64 non-null     int64
 2   Path             64 non-null     object
 3   Sales Rep Name   64 non-null     object
 4   Sales Rep Name1  64 non-null     object
 5   Sales Rep Name2  64 non-null     object
 6   Sales Rep Name3  64 non-null     object
 7   Sales Rep ID     64 non-null     int64
dtypes: int64(2), object(6)
memory usage: 4.1+ KB

In [52]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96466 entries, 0 to 96465
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   %KEY                    96466 non-null  int64
 1   Cost                    96466 non-null  float64
 2   Customer Number         96466 non-null  int64
 3   Date                    96466 non-null  object
 4   GrossSales              96466 non-null  float64
 5   Invoice Date            96466 non-null  object
 6   Invoice Number          96466 non-null  int64
 7   Item Desc               96466 non-null  object
 8   Item Number             96466 non-null  int64
 9   Margin                  96466 non-null  float64
 10  Order Number            96466 non-null  int64
 11  Promised Delivery Date  96466 non-null  object
 12  Sales                   96466 non-null  float64
 13  Sales Qty               96466 non-null  float64
 14  Sales Rep Number        96466 non-null  int64
dtypes: float64(5), int64(6), object(4)
memory usage: 11.0+ MB

In [54]:
cities.describe()

        City Code    Latitude   Longitude
count  100.000000  100.000000  100.000000
mean    50.500000   44.813257  -28.028824
std     29.011492    9.437991   67.404008
min      1.000000   25.774266 -122.674195
25%     25.750000   36.589686  -87.698940
50%     50.500000   42.354573   -3.188403
75%     75.250000   53.386865    7.764462
max    100.000000   64.145981  141.354460

In [55]:
customers.describe()

       Customer Number   City Code
count     6.840000e+02  684.000000
mean      1.001662e+07   49.833333
std       7.898470e+03   30.390504
min       1.000000e+07    1.000000
25%       1.001091e+07   23.000000
50%       1.001917e+07   48.000000
75%       1.002351e+07   74.000000
max       1.002763e+07  100.000000

In [56]:
item_master.describe()

        Item Number
count    827.000000
mean   10522.220073
std      310.710951
min    10001.000000
25%    10268.500000
50%    10534.000000
75%    10800.500000
max    11971.000000

In [57]:
sales_rep.describe()

       Manager Number  Sales Rep ID
count       64.000000     64.000000
mean       144.984375    143.515625
std         27.551679     25.038378
min        104.000000    103.000000
25%        118.000000    119.750000
50%        144.500000    144.500000
75%        169.000000    163.750000
max        185.000000    185.000000

In [58]:
sales.describe()

,%KEY,Cost,Customer Number,GrossSales,Invoice Number,Item Number,Margin,Order Number,Sales,Sales Qty,Sales Rep Number
count,96466.000000,96466.000000,9.646600e+04,96466.000000,96466.000000,96466.000000,96466.000000,96466.000000,96466.000000,96466.000000,96466.000000
mean,54715.166732,638.272186,1.001751e+07,1097.916246,213089.625339,10512.149856,448.377554,193854.617637,1086.939179,18.829146,137.341478
std,32130.384196,6435.093413,7.360265e+03,10243.399673,90626.900031,292.454663,3848.809989,73985.562829,10147.213456,293.555730,26.283149
min,1.000000,-9392.930000,1.000000e+07,-27929.875200,100001.000000,10001.000000,-27929.880000,100012.000000,-27929.880000,-1000.000000,103.000000
25%,26793.250000,13.280000,1.001242e+07,33.241525,118843.500000,10266.000000,16.410000,117828.500000,32.950000,1.000000,114.000000
50%,54144.500000,55.460000,1.001942e+07,114.010000,219354.000000,10522.500000,50.290000,206875.000000,112.655000,1.000000,132.000000
75%,82704.750000,180.540000,1.002352e+07,328.581400,312243.000000,10797.000000,139.500000,222532.750000,325.240000,3.000000,160.000000
max,110409.000000,366576.000000,1.002758e+07,539200.000000,332847.000000,11971.000000,202083.200000,326618.000000,555376.000000,16000.000000,185.000000